foodAppBackEnd/foodAppBackEnd/app/CentralLogics/helpers.php

select * from `business_settings` where (`key` = 'language') limit 1
---
    public static function get_business_settings($name)
    {
        $config = null;
        $data = \App\Model\BusinessSetting::where(['key' => $name])->first();

select * from `business_settings` where (`key` = 'currency') limit 1
---
    public static function currency_code()
    {
        $currency_code = BusinessSetting::where(['key' => 'currency'])->first()->value;

select * from `currencies` where (`currency_code` = 'DZ') limit 1
---
    public static function currency_symbol()
    {
        $currency_symbol = Currency::where(['currency_code' => Helpers::currency_code()])->first()->currency_symbol;

select * from `product_by_branches` where (`stock_type` = 'daily')
---
    public static function update_daily_product_stock() {
        $currentDay = now()->day;
        $currentMonth = now()->month;
        $products = ProductByBranch::where(['stock_type' => 'daily'])->get();