foodAppBackEnd/foodAppBackEnd/app/Http/Controllers/Admin/BusinessSettingsController.php

select * from `business_settings` where (`key` = 'minimum_order_value') limit 1
---
    public function restaurantIndex(): Renderable
    {
        if (!$this->business_setting->where(['key' => 'minimum_order_value'])->first()) {