foodAppBackEnd/foodAppBackEnd/app/Http/Controllers/Admin/DashboardController.php

    public function dashboard(): Renderable
    {
        //update daily stock
        Helpers::update_daily_product_stock();

        $topSell = $this->orderDetail->with(['product'])
            ->whereHas('order', function ($query) {
                $query->where('order_status', 'delivered');
            })
            ->select('product_id', DB::raw('SUM(quantity) as count'))
            ->groupBy('product_id')
            ->orderBy("count", 'desc')
            ->take(6)
            ->get();

        $mostRatedProducts = $this->review->with(['product'])
            ->select(['product_id',
                DB::raw('AVG(rating) as ratings_average'),
                DB::raw('COUNT(rating) as total'),
            ])
            ->groupBy('product_id')
            ->orderBy("total", 'desc')
            ->take(7)
            ->get();

        $topCustomer = $this->order->with(['customer'])
            ->select('user_id', DB::raw('COUNT(user_id) as count'))
            ->groupBy('user_id')
            ->orderBy("count", 'desc')
            ->take(6)
            ->get();

        $data = self::orderStatsData();

        $data['customer'] = $this->user->count();
        $data['product'] = $this->product->count();
        $data['order'] = $this->order->count();
        $data['category'] = $this->category->where('parent_id', 0)->count();
        $data['branch'] = $this->branch->count();
---
select `product_id`, SUM(quantity) as count from `order_details` where exists (select * from `orders` where `order_details`.`order_id` = `orders`.`id` and `order_status` = 'delivered') group by `product_id` order by `count` desc limit 6
select `product_id`, AVG(rating) as ratings_average, COUNT(rating) as total from `reviews` group by `product_id` order by `total` desc limit 7
select `user_id`, COUNT(user_id) as count from `orders` group by `user_id` order by `count` desc limit 6
select count(*) as aggregate from `users`
select count(*) as aggregate from `products`
select count(*) as aggregate from `orders`
select count(*) as aggregate from `categories` where `parent_id` = 0
select count(*) as aggregate from `branches`

        $to = Carbon::now()->endOfYear()->format('Y-m-d');

        $earning = [];
        $earning_data = $this->order->where([
            'order_status' => 'delivered',
        ])->select(
            DB::raw('IFNULL(sum(order_amount),0) as sums'),
            DB::raw('YEAR(created_at) year, MONTH(created_at) month')
        )
            ->whereBetween('created_at', [Carbon::parse(now())->startOfYear(), Carbon::parse(now())->endOfYear()])
            ->groupby('year', 'month')->get()->toArray();
---
select IFNULL(sum(order_amount),0) as sums, YEAR(created_at) year, MONTH(created_at) month from `orders` where (`order_status` = 'delivered') and `created_at` between '2024-01-01 00:00:00' and '2024-12-31 23:59:59' group by `year`, `month`

        }

        $order_statistics_chart = [];
        $order_statistics_chart_data = $this->order->where(['order_status' => 'delivered'])
            ->select(
                DB::raw('(count(id)) as total'),
                DB::raw('YEAR(created_at) year, MONTH(created_at) month')
            )
---
select (count(id)) as total, YEAR(created_at) year, MONTH(created_at) month from `orders` where (`order_status` = 'delivered') and `created_at` between '2024-01-01 00:00:00' and '2024-12-31 23:59:59' group by `year`, `month`

        }

        $donut = [];
        $donutData = $this->order->all();
---
select * from `orders`

        $donut['returned'] = $donutData->where('order_status', 'returned')->count();
        $donut['failed'] = $donutData->where('order_status', 'failed')->count();

        $data['recent_orders'] = $this->order->latest()->take(5)->get();
---
select * from `orders` order by `created_at` desc limit 5

    public function orderStatsData(): array
    {
        $today = session()->has('statistics_type') && session('statistics_type') == 'today' ? 1 : 0;
        $this_month = session()->has('statistics_type') && session('statistics_type') == 'this_month' ? 1 : 0;

        $pending = $this->order
            ->where(['order_status' => 'pending'])
            ->notSchedule()
            ->when($today, function ($query) {
                return $query->whereDate('created_at', \Carbon\Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
        $confirmed = $this->order
            ->where(['order_status' => 'confirmed'])
            ->when($today, function ($query) {
                return $query->whereDate('created_at', Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
        $processing = $this->order
            ->where(['order_status' => 'processing'])
            ->when($today, function ($query) {
                return $query->whereDate('created_at', Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
        $outForDelivery = $this->order
            ->where(['order_status' => 'out_for_delivery'])
            ->when($today, function ($query) {
                return $query->whereDate('created_at', Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
        $canceled = $this->order
            ->where(['order_status' => 'canceled'])
            ->when($today, function ($query) {
                return $query->whereDate('created_at', Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
        $delivered = $this->order
            ->where(['order_status' => 'delivered'])
            ->when($today, function ($query) {
                return $query->whereDate('created_at', Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
        $all = $this->order
            ->when($today, function ($query) {
                return $query->whereDate('created_at', Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
        $returned = $this->order
            ->where(['order_status' => 'returned'])
            ->when($today, function ($query) {
                return $query->whereDate('created_at', Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
        $failed = $this->order
            ->where(['order_status' => 'failed'])
            ->when($today, function ($query) {
                return $query->whereDate('created_at', Carbon::today());
            })
            ->when($this_month, function ($query) {
                return $query->whereMonth('created_at', Carbon::now());
            })
            ->count();
---
select count(*) as aggregate from `orders` where (`order_status` = 'confirmed')
select count(*) as aggregate from `orders` where (`order_status` = 'processing')
select count(*) as aggregate from `orders` where (`order_status` = 'out_for_delivery')
select count(*) as aggregate from `orders` where (`order_status` = 'canceled')
select count(*) as aggregate from `orders` where (`order_status` = 'delivered')
select count(*) as aggregate from `orders`
select count(*) as aggregate from `orders` where (`order_status` = 'returned')
select count(*) as aggregate from `orders` where (`order_status` = 'failed')